{
  "manifest_description": {
    "message": "Fast and convenient downloading of movies and TV shows from rezka.ag! Access your favorite movies and TV shows in just a few clicks."
  },
  "popup_stub_default": {
    "message": "To download the video, go to the show's or movie's page on the website."
  },
  "popup_stub_trailer": {
    "message": "It seems that the content is pending release.\nCheck back later!"
  },
  "popup_stub_locationFilm": {
    "message": "Sorry, but the movie is not available from your location :("
  },
  "popup_stub_locationSerial": {
    "message": "Sorry, but the series is not available from your location :("
  },
  "popup_stub_vpn": {
    "message": "Try using a VPN."
  },
  "popup_stub_unavailable": {
    "message": "Content is unavailable for download — no data to process."
  },
  "popup_stub_error": {
    "message": "Oops! Something went wrong..."
  },
  "popup_loadSerial": {
    "message": "Load series"
  },
  "popup_loadSubtitle": {
    "message": "Load subtitle"
  },
  "popup_textFrom": {
    "message": "from"
  },
  "popup_textTo": {
    "message": "to"
  },
  "popup_textEndEpisodes": {
    "message": "the end of the season"
  },
  "popup_textEndSeasons": {
    "message": "the end of the series"
  },
  "popup_subtitleLang": {
    "message": "Lang"
  },
  "popup_quality": {
    "message": "Quality"
  },
  "popup_translate": {
    "message": "Translate"
  },
  "popup_DownloadCancel": {
    "message": "Cancel download"
  },
  "combobox_placeholder": {
    "message": "Select value"
  },
  "combobox_search": {
    "message": "Search..."
  },
  "combobox_empty": {
    "message": "No results found"
  },
  "message_noDataVideo": {
    "message": "Failed to retrieve video data. Check your internet connection or use a VPN."
  },
  "message_errorLoad": {
    "message": "Error loading. Check your internet connection or use a VPN."
  },
  "message_userBreak": {
    "message": "You interrupted the loading."
  },
  "settings_TabSettings": {
    "message": "Settings"
  },
  "settings_TabFAQ": {
    "message": "FAQ"
  },
  "settings_TabChangelog": {
    "message": "Changelog"
  },
  "settings_TabAbout": {
    "message": "About Extension"
  },
  "settings_SourceCode": {
    "message": "Source Code on GitHub"
  },
  "settings_DownloadExtension": {
    "message": "Download Extension"
  },
  "settings_ShortDescription": {
    "message": "Open Source extension for downloading movies and TV shows from rezka.ag!"
  },
  "settings_LongDescription": {
    "message": "HDrezka Grabber is a universal tool for downloading your favorite movies and TV shows from rezka.ag! Control everything: choose dubbing, subtitles, or even download an entire series in one click. Customize file name templates for your media library and speed up the process with parallel downloads. A modern minimalist interface with light and dark theme support, as well as compatibility with most browsers, makes this tool your perfect assistant."
  },
  "settings_AboutTitle": {
    "message": "About the Project"
  },
  "settings_LicenseTitle": {
    "message": "License"
  },
  "settings_ContactsTitle": {
    "message": "Contacts"
  },
  "settings_CopyTitle": {
    "message": "Copy"
  },
  "settings_SupportTitle": {
    "message": "Support the Project"
  },
  "settings_SupportDescription": {
    "message": "Thank you for using $extensionName$. If you like the extension, please consider making a small donation as a token of appreciation.",
    "placeholders": {
      "extensionName": {
        "content": "$1"
      }
    }
  },
  "settings_SupportButton": {
    "message": "Support"
  },
  "settings_patreonSubtitle": {
    "message": "Monthly Support"
  },
  "settings_PayPalSubtitle": {
    "message": "One-Time Donation"
  },
  "settings_MoneroSubtitle": {
    "message": "Cryptocurrency Support"
  },
  "settings_GitHubSubtitle": {
    "message": "Sponsorship via GitHub"
  },
  "settings_DevelopersTitle": {
    "message": "People Involved in Development"
  },
  "settings_AuthorDescription": {
    "message": "Project author. Responsible for developing the internal logic of the extension."
  },
  "settings_SecondPilotDescription": {
    "message": "Co-pilot. Responsible for the design and appearance of the extension."
  },
  "settings_FaqQuestion_1": {
    "message": "How to choose where to download files?"
  },
  "settings_FaqAnswer_1": {
    "message": "The extension cannot affect this in any way. The browser does not allow extensions to specify paths outside the standard \"Downloads\" folder. The only option is to manually change the default download folder in the browser settings."
  },
  "settings_FaqQuestion_2": {
    "message": "When choosing 1080p/1080p-Ultra quality, the video is downloaded at 720p"
  },
  "settings_FaqAnswer_2": {
    "message": "This is not a bug of the extension, but rather a consequence of how it works. To play a movie on the site, the player must first request the server to provide access to the desired video. The server responds with a link to the video — each quality (whether 360p or 1080p) has a unique link that only the server can provide, since all content is stored there. The extension imitates the player’s behavior and knows how to get this link to download the file. However, when rezka’s servers are under heavy load, they begin to downgrade the quality. You may still see the 1080p option, but when requesting it, the server automatically downgrades to the next lower quality — in this case, 720p. The extension can detect such downgrades, but since it cannot get the 1080p link, it downloads what is available. In the extension’s settings, you can configure behavior when a downgrade is detected. Also, since the extension mimics the player, you can verify the downgrade yourself by simply watching the video in the site’s player."
  },
  "settings_FaqQuestion_3": {
    "message": "The extension downloads files slowly, even though I have fast internet"
  },
  "settings_FaqAnswer_3": {
    "message": "The extension does not affect download speed, as it uses the built-in browser download API, meaning the browser itself is the real initiator of downloads. Unfortunately, download speed depends not only on your internet connection: it can also be limited by the upload speed of rezka’s servers. This is especially noticeable in the evenings, when people come home and start watching movies — servers get overloaded, which may slow downloads, or even lower video quality from 1080p to 720p. However, one mystery remains: sometimes, when downloading several files of the same size, one file gets stuck at half, while a dozen others finish in parallel. Sometimes pausing and immediately resuming the slow download helps."
  },
  "settings_FaqQuestion_4": {
    "message": "How does the extension work?"
  },
  "settings_FaqAnswer_4": {
    "message": "In simple terms, the extension’s logic works like this. When you open the popup, several key events occur. The extension tries to detect the page type — if it is not a movie or TV show page on the rezka.ag family of sites, it shows a placeholder message and stops further actions. If the page is suitable, the extension tries to retrieve player data (technical info, episode numbers, dubbing options, selected parameters, etc.). To do this, it injects a script that extracts the data from the page and sends it back to the extension. Once you start a download, two parameters are required — the filename and the file link. The filename is generated from the popup data and user template in settings; the link comes from the server. Imitating the player, the extension sends a request for the desired video, and the server responds with a list of links and available qualities (this is where issues with incorrect quality can occur if the server marks a link as higher quality than it really is). The extension chooses the appropriate link and passes it to the browser to start the download — this may take some time. Once the browser begins downloading, the extension monitors download events and reacts accordingly. At the same time, the extension manages multiple downloads, as there may be 100+ queued."
  },
  "settings_FaqQuestion_5": {
    "message": "Why does the extension need access to all sites?"
  },
  "settings_FaqAnswer_5": {
    "message": "Access to all sites is required in case you use rezka mirrors. During development, there were two options: either constantly update the list of available sites whenever a new mirror appears (and release a new update), or give the extension access to all sites and check each time whether the current site is a target — if not, just ignore it. I chose the second option because it’s less time-consuming, and also ensures that if support for the extension stops in the future, it will still work correctly with existing mirrors."
  },
  "settings_FaqQuestion_6": {
    "message": "Does the extension support other site mirrors?"
  },
  "settings_FaqAnswer_6": {
    "message": "Yes, it does. When opening the popup, the extension checks whether the site matches the rezka.ag pattern; if not, it notifies you that the site is unrecognized and suggests switching to the official rezka.ag. Since all OFFICIAL mirrors follow the pattern, they work without issue. However, keep in mind: besides official mirrors, there may be others! In rare cases, the pattern in the extension may become outdated — then downloading will be impossible, even from the official site."
  },
  "settings_FaqQuestion_7": {
    "message": "How to download multiple movies/TV shows at once?"
  },
  "settings_FaqAnswer_7": {
    "message": "The extension supports background downloading, meaning you do NOT need to stay on the same page where you started the download: after initiating, you can close the tab and continue with other tasks. The extension has a download queue — you can add multiple movies/TV shows, and as soon as a slot becomes available, the extension will automatically start the next download. The number of slots can be configured in the “Settings” section."
  },
  "settings_FaqQuestion_8": {
    "message": "How are files downloaded, is the torrent protocol used?"
  },
  "settings_FaqAnswer_8": {
    "message": "No — the torrent protocol is not used. The extension imitates the site’s player and uses streaming file transfer. If you are interested in the legal aspects: the extension itself is just an external interface for downloading from the site, and all legal questions should be addressed to the site’s administration, not the extension."
  }
}
