{
  "manifest_description": {
    "message": "Быстрое и удобное скачивание фильмов и сериалов с rezka.ag! Получайте доступ к вашим любимым фильмам и сериалам за несколько кликов."
  },
  "popup_stub_default": {
    "message": "Для скачивания видео перейдите на страницу сериала или фильма на сайте"
  },
  "popup_stub_trailer": {
    "message": "Похоже что контент в ожидании выхода.\nВернитесь сюда позже!"
  },
  "popup_stub_locationFilm": {
    "message": "Увы, но фильм не доступен с вашего местоположения :("
  },
  "popup_stub_locationSerial": {
    "message": "Увы, но сериал не доступен с вашего местоположения :("
  },
  "popup_stub_vpn": {
    "message": "Попробуйте воспользоваться VPN."
  },
  "popup_stub_unavailable": {
    "message": "Контент недоступен для загрузки — отсутствуют данные для обработки."
  },
  "popup_stub_error": {
    "message": "Упс! Кажется что-то пошло не так..."
  },
  "popup_loadSerial": {
    "message": "Загрузить сериал"
  },
  "popup_loadSubtitle": {
    "message": "Загрузить субтитры"
  },
  "popup_textFrom": {
    "message": "с"
  },
  "popup_textTo": {
    "message": "до"
  },
  "popup_textEndEpisodes": {
    "message": "конца сезона"
  },
  "popup_textEndSeasons": {
    "message": "конца сериала"
  },
  "popup_subtitleLang": {
    "message": "Язык"
  },
  "popup_translate": {
    "message": "Озвучка"
  },
  "popup_quality": {
    "message": "Качество"
  },
  "combobox_placeholder": {
    "message": "Выберите значение"
  },
  "combobox_search": {
    "message": "Поиск..."
  },
  "combobox_empty": {
    "message": "Ничего не найдено"
  },
  "message_noDataVideo": {
    "message": "Не удалось получить данные видео. Проверьте интернет соединение или используйте VPN."
  },
  "message_errorLoad": {
    "message": "Ошибка загрузки. Проверьте интернет соединение или используйте VPN."
  },
  "message_userBreak": {
    "message": "Вы прервали загрузку."
  },
  "settings_TabSettings": {
    "message": "Настройки"
  },
  "settings_TabFAQ": {
    "message": "FAQ"
  },
  "settings_TabChangelog": {
    "message": "История изменений"
  },
  "settings_TabAbout": {
    "message": "О расширении"
  },
  "settings_SourceCode": {
    "message": "Исходный код на GitHub"
  },
  "settings_DownloadExtension": {
    "message": "Скачать расширение"
  },
  "settings_ShortDescription": {
    "message": "Open Source расширение для загрузки фильмов и сериалов с rezka.ag!"
  },
  "settings_LongDescription": {
    "message": "HDrezka Grabber — универсальный инструмент для загрузки любимых фильмов и сериалов с rezka.ag! Контролируйте всё: выбирайте озвучку, субтитры или если нужно скачайте целый сериал в один клик. Настраивайте шаблон имён файлов для своей медиатеки и ускоряйте процесс с помощью параллельной загрузки. Современный минималистичный интерфейс с поддержкой светлой и тёмной темы, а так же доступность для большинства браузеров делают этот инструмент вашим идеальным помощником."
  },
  "settings_AboutTitle": {
    "message": "О проекте"
  },
  "settings_LicenseTitle": {
    "message": "Лицензия"
  },
  "settings_ContactsTitle": {
    "message": "Контакты"
  },
  "settings_CopyTitle": {
    "message": "Копировать"
  },
  "settings_SupportTitle": {
    "message": "Поддержать проект"
  },
  "settings_SupportDescription": {
    "message": "Спасибо что используете $extensionName$. Если вам нравится расширение, пожалуйста, подумайте о внесении небольшого пожертвования в качестве благодарности.",
    "placeholders": {
      "extensionName": {
        "content": "$1"
      }
    }
  },
  "settings_SupportButton": {
    "message": "Поддержать"
  },
  "settings_patreonSubtitle": {
    "message": "Ежемесячная поддержка"
  },
  "settings_PayPalSubtitle": {
    "message": "Разовое пожертвование"
  },
  "settings_MoneroSubtitle": {
    "message": "Криптовалютная поддержка"
  },
  "settings_GitHubSubtitle": {
    "message": "Спонсорство через GitHub"
  },
  "settings_DevelopersTitle": {
    "message": "Люди причастные к разработке"
  },
  "settings_AuthorDescription": {
    "message": "Автор проекта. Ответственен за разработку внутренней логики работы расширения."
  },
  "settings_SecondPilotDescription": {
    "message": "Второй пилот. Ответственен за дизайн и внешний вид расширения."
  },
  "settings_FaqQuestion_1": {
    "message": "Как выбрать, куда загружать файлы?"
  },
  "settings_FaqAnswer_1": {
    "message": "Увы, расширение никак не может повлиять на это. Единственный реальный вариант — вручную изменить папку загрузки, что крайне непрактично. Это связано с тем, что расширение использует browser downloads API, который не позволяет указывать пути вне стандартной папки \"Загрузки\" — сделано это в целях безопасности, ибо, согласитесь, вам бы не понравилось, если бы кто-угодно мог загрузить файл непонятного содержания в любое место вашего компьютера."
  },
  "settings_FaqQuestion_2": {
    "message": "При выборе качества 1080р/1080р-Ultra скачивается видеофайл с разрешением 720р"
  },
  "settings_FaqAnswer_2": {
    "message": "Это не баг расширения, а скорее следствие принципа его работы. Чтобы посмотреть фильм на сайте, плеер сначала должен «просить» сервер сайта предоставить доступ к нужному вам видео, сервер вернёт в качестве ответа ссылку на нужное видео — каждое качество (будь то 360р или 1080р) — это уникальная ссылка на видео, которую может вернуть только сервер, поскольку именно на нём хранятся все фильмы и сериалы. Расширение имитирует поведение плеера и знает, как получить эту ссылку, что бы загрузить файл. Однако когда сервера резки испытывают сильную нагрузку они начинают понижать качество. Вы всё ещё будете видеть выбор 1080р, но если запросить ссылку на это качество, сервер автоматически понизит качество на одну ступень ниже — в данном случае 720р. Расширение способно обнаруживать понижение качества, но, так как получить ссылку на 1080р у него нет возможности, оно загружает то, что доступно. В настройках расширения можно задать поведение при обнаружении понижения качества. Также, поскольку расширение имитирует работу плеера, вы можете самостоятельно убедиться в понижении качества сервером — просто посмотрите видео в плеере на сайте."
  },
  "settings_FaqQuestion_3": {
    "message": "Расширение медленно загружает файлы, хотя у меня быстрый интернет"
  },
  "settings_FaqAnswer_3": {
    "message": "Расширение не влияет на скорость загрузки, так как использует встроенный browser download API, из-за чего реальным инициатором загрузки по сути является сам браузер. К сожалению, скорость загрузки зависит не только от вашего интернета: она может ограничиваться скоростью отдачи файлов серверами резки. Особенно это заметно вечерами, когда люди возвращаются домой и начинают смотреть фильмы — серверы испытывают нагрузку, что вполне может повлиять на скорость загрузки файла, вплоть до того, что понизят качество видео, когда вместо заветных 1080p сервер вернёт 720p. Однако для меня остаются загадкой те моменты, когда при одновременной загрузке нескольких файлов одного размера один файл иногда загружается только наполовину, тогда как параллельно успевают загрузиться десяток других. Порой помогает остановить загрузку медленного файла и сразу же запустить её снова."
  },
  "settings_FaqQuestion_4": {
    "message": "Как работает расширение?"
  },
  "settings_FaqAnswer_4": {
    "message": "Упрощённо логику работы расширения можно описать так. Когда вы открываете попап, происходят несколько основных событий. Расширение пытается определить тип страницы — если это не страница с фильмом или сериалом на сайте семейства rezka.ag, расширение покажет заглушку о том, что страница не подходит, и прекратит какие либо дальнейшие действия. Если же тип страницы подходящий, расширение стремится получить данные плеера (различная служебная информация, номера серий, типы озвучек, выбранные параметры и т.д.). Для этого внедряется скрипт, который извлечёт эти данные со страницы и отправит их в расширение. После того как вы запустите загрузку, начинается этап загрузки: чтобы её инициализировать, расширению нужны два параметра — имя файла и ссылка на файл. Имя формируется из данных, полученных при открытии попапа, и шаблона пользователя в настройках; ссылка же возвращается сервером. Имитируя работу плеера на сайте, расширение отправляет серверу запрос с данными желаемого видео, после чего сервер в ответ возвращает список ссылок и соответствующий им список качеств (Именно здесь может возникнуть проблема с некорректным качеством, когда сервер помечает ссылку реальное качество которого ниже, чем ожидает пользователь). Расширение выбирает подходящую ссылку из ответа и передаёт её браузеру для инициализации загрузки — это может занять некоторое время. Когда браузер начинает загрузку, расширение отслеживает события этой загрузки и в зависимости от события принимает решения как на него реагировать. При этом расширение управляет несколькими загрузками одновременно, ведь в очереди может стоять ещё 100+ других загрузок которые так же должны быть загружены."
  },
  "settings_FaqQuestion_5": {
    "message": "Зачем расширению нужен доступ ко всем сайтам?"
  },
  "settings_FaqAnswer_5": {
    "message": "Доступ ко всем сайтам нужен на случай, если вы пользуетесь зеркалами rezka. При разработке было два варианта решения задачи доступа к зеркалам: либо обновлять список доступных сайтов, когда появляется новое зеркало, и выкатывать новое обновление, либо дать расширению доступ ко всем сайтам и при каждом взаимодействии проверять, является ли текущий сайт целевым  — если нет, просто игнорировать его. Я выбрал второй вариант из-за меньших время затрат, к тому же, в будущем, если поддержка расширения прекратится, оно всё равно сможет продолжить корректно работать с существующими зеркалами."
  },
  "settings_FaqQuestion_6": {
    "message": "Поддерживает ли расширение другие зеркала сайта?"
  },
  "settings_FaqAnswer_6": {
    "message": "Да, поддерживает. При открытии попапа расширение проверяет, соответствует ли сайт шаблону построения сайта rezka.ag; если нет, оно уведомит вас, что сайт не распознан, и предложит перейти на официальный сайт rezka.ag. Поскольку все ОФИЦИАЛЬНЫЕ зеркала соответствуют шаблону, они будут работать без проблем, но обратите внимание: помимо официальных зеркал могут быть и другие! В редких случаях шаблон в расширении может устареть — тогда загрузка будет невозможна даже с официального сайта."
  },
  "settings_FaqQuestion_7": {
    "message": "Как загружать несколько фильмов/сериалов одновременно?"
  },
  "settings_FaqAnswer_7": {
    "message": "Расширение поддерживает фоновую загрузку файлов, то есть вам НЕ обязательно оставаться на той же странице, с которой вы запустили загрузку: после инициирования загрузки можно закрыть вкладку и продолжить заниматься своими делами. У расширения есть очередь загрузок — вы можете поставить на загрузку несколько фильмов/сериалов, и как только появится свободный слот расширение автоматически поставит на загрузку следующее видео. Количество слотов загрузки можно настроить в разделе «Настройки»."
  },
  "settings_FaqQuestion_8": {
    "message": "Как происходит загрузка файлов, используется ли torrent-протокол?"
  },
  "settings_FaqAnswer_8": {
    "message": "Нет — torrent-протокол не используется. Расширение имитирует работу плеера на сайте и использует потоковую передачу файлов. Если вас интересуют правовые аспекты использования расширения: само расширение является лишь внешним интерфейсом для загрузки с сайта, и все правовые вопросы следует адресовать администрации сайта, а не расширению."
  }
}
