{
  "manifest_description": {
    "message": "Быстрое и удобное скачивание фильмов и сериалов с rezka.ag! Получайте доступ к вашим любимым фильмам и сериалам за несколько кликов."
  },
  "popup_stub_default": {
    "message": "Для скачивания видео перейдите на страницу сериала или фильма на сайте"
  },
  "popup_stub_trailer": {
    "message": "Похоже что контент в ожидании выхода.\nВернитесь сюда позже!"
  },
  "popup_stub_locationFilm": {
    "message": "Увы, но фильм не доступен с вашего местоположения :("
  },
  "popup_stub_locationSerial": {
    "message": "Увы, но сериал не доступен с вашего местоположения :("
  },
  "popup_stub_vpn": {
    "message": "Попробуйте воспользоваться VPN."
  },
  "popup_stub_unavailable": {
    "message": "Контент недоступен для загрузки — отсутствуют данные для обработки."
  },
  "popup_stub_error": {
    "message": "Упс! Кажется что-то пошло не так..."
  },
  "popup_stub_splitView": {
    "message": "Вкладка открыта в режиме Split View, вам необходимо выделить желаемое окно для работы с ним."
  },
  "popup_loadSerial": {
    "message": "Загрузить сериал"
  },
  "popup_loadSubtitle": {
    "message": "Загрузить субтитры"
  },
  "popup_textFrom": {
    "message": "с"
  },
  "popup_textTo": {
    "message": "до"
  },
  "popup_textEndEpisodes": {
    "message": "конца сезона"
  },
  "popup_textEndSeasons": {
    "message": "конца сериала"
  },
  "popup_subtitleLang": {
    "message": "Язык"
  },
  "popup_quality": {
    "message": "Качество"
  },
  "popup_translate": {
    "message": "Озвучка"
  },
  "popup_DownloadCancel": {
    "message": "Отменить загрузку"
  },
  "combobox_placeholder": {
    "message": "Выберите значение"
  },
  "combobox_search": {
    "message": "Поиск..."
  },
  "combobox_empty": {
    "message": "Ничего не найдено"
  },
  "message_noDataVideo": {
    "message": "Не удалось получить данные видео. Проверьте интернет соединение или используйте VPN."
  },
  "message_errorLoad": {
    "message": "Ошибка загрузки. Проверьте интернет соединение или используйте VPN."
  },
  "message_userBreak": {
    "message": "Вы прервали загрузку."
  },
  "settings_TabSettings": {
    "message": "Настройки"
  },
  "settings_TabFAQ": {
    "message": "FAQ"
  },
  "settings_TabChangelog": {
    "message": "История изменений"
  },
  "settings_TabAbout": {
    "message": "О расширении"
  },
  "settings_SourceCode": {
    "message": "Исходный код на GitHub"
  },
  "settings_DownloadExtension": {
    "message": "Скачать расширение"
  },
  "settings_ShortDescription": {
    "message": "Open Source расширение для загрузки фильмов и сериалов с rezka.ag!"
  },
  "settings_LongDescription": {
    "message": "HDrezka Grabber — универсальный инструмент для загрузки любимых фильмов и сериалов с rezka.ag! Контролируйте всё: выбирайте озвучку, субтитры или если нужно скачайте целый сериал в один клик. Настраивайте шаблон имён файлов для своей медиатеки и ускоряйте процесс с помощью параллельной загрузки. Современный минималистичный интерфейс с поддержкой светлой и тёмной темы, а так же доступность для большинства браузеров делают этот инструмент вашим идеальным помощником."
  },
  "settings_AboutTitle": {
    "message": "О проекте"
  },
  "settings_LicenseTitle": {
    "message": "Лицензия"
  },
  "settings_ContactsTitle": {
    "message": "Контакты"
  },
  "settings_CopyTitle": {
    "message": "Копировать"
  },
  "settings_SupportTitle": {
    "message": "Поддержать проект"
  },
  "settings_SupportDescription": {
    "message": "Спасибо что используете $extensionName$. Если вам нравится расширение, пожалуйста, подумайте о внесении небольшого пожертвования в качестве благодарности.",
    "placeholders": {
      "extensionName": {
        "content": "$1"
      }
    }
  },
  "settings_SupportButton": {
    "message": "Поддержать"
  },
  "settings_patreonSubtitle": {
    "message": "Ежемесячная поддержка"
  },
  "settings_PayPalSubtitle": {
    "message": "Разовое пожертвование"
  },
  "settings_MoneroSubtitle": {
    "message": "Криптовалютная поддержка"
  },
  "settings_GitHubSubtitle": {
    "message": "Спонсорство через GitHub"
  },
  "settings_DevelopersTitle": {
    "message": "Люди причастные к разработке"
  },
  "settings_AuthorDescription": {
    "message": "Автор проекта. Ответственен за разработку внутренней логики работы расширения."
  },
  "settings_SecondPilotDescription": {
    "message": "Второй пилот. Ответственен за дизайн и внешний вид расширения."
  },
  "settings_FaqQuestion_1": {
    "message": "Как выбрать, куда загружать файлы?"
  },
  "settings_FaqAnswer_1": {
    "message": "Расширение никак не может повлиять на это. Браузер не позволяет расширениям указывать пути вне стандартной папки \"Загрузки\". Единственный вариант — вручную поменять стандартную папку загрузки в настройках браузера."
  },
  "settings_FaqQuestion_2": {
    "message": "При выборе качества 1080р/1080р-Ultra скачивается видеофайл с разрешением 720р"
  },
  "settings_FaqAnswer_2": {
    "message": "Это не баг расширения, а особенность работы сайта. Чтобы показать фильм, плеер запрашивает у сервера ссылку на видео нужного качества. Если сервер перегружен, он может автоматически понизить качество — например, вместо 1080p выдать 720p. Расширение получает ровно ту ссылку, которую возвращает сервер. Проверить ситуацию можно прямо на сайте: в плеере качество тоже снизится."
  },
  "settings_FaqQuestion_3": {
    "message": "Расширение медленно загружает файлы, хотя у меня быстрый интернет"
  },
  "settings_FaqAnswer_3": {
    "message": "Расширение не замедляет загрузку. Скорость зависит не только от вашего интернета, но и от серверов, с которых идёт раздача. В часы пик они могут работать медленнее, из-за чего падает скорость и иногда даже качество видео."
  },
  "settings_FaqQuestion_4": {
    "message": "Как работает расширение?"
  },
  "settings_FaqAnswer_4": {
    "message": "Когда вы открываете выпадающее меню, расширение проверяет, на подходящем ли вы сайте. Если это не фильм или сериал на сайте из семейства rezka.ag, оно просто покажет заглушку и остановится. Если страница подходит, расширение получает данные плеера (серия, озвучка, параметры и т.п.). Для этого на страницу временно вставляется скрипт, который собирает нужную информацию и передаёт её расширению. Когда вы нажимаете «Скачать», расширение формирует имя файла и запрашивает у сервера список ссылок на видео разных качеств. Расширение выбирает нужную ссылку и отдаёт её браузеру, который и запускает скачивание. Далее расширение просто следит за загрузкой и реагирует на её события. Так же оно может управлять сразу несколькими загрузками."
  },
  "settings_FaqQuestion_5": {
    "message": "Зачем расширению нужен доступ ко всем сайтам?"
  },
  "settings_FaqAnswer_5": {
    "message": "Доступ ко всем сайтам нужен для того чтоб расширение могло работать с зеркалами rezka."
  },
  "settings_FaqQuestion_6": {
    "message": "Поддерживает ли расширение другие зеркала сайта?"
  },
  "settings_FaqAnswer_6": {
    "message": "Да, поддерживает. При открытии попапа расширение проверяет, соответствует ли сайт шаблону построения сайта rezka.ag; если нет, оно уведомит вас, что сайт не распознан, и предложит перейти на официальный сайт rezka.ag. Поскольку все ОФИЦИАЛЬНЫЕ зеркала соответствуют шаблону, они будут работать без проблем, но обратите внимание: помимо официальных зеркал могут быть и другие! В редких случаях шаблон в расширении может устареть — тогда загрузка будет невозможна даже с официального сайта."
  },
  "settings_FaqQuestion_7": {
    "message": "Как загружать несколько фильмов/сериалов одновременно?"
  },
  "settings_FaqAnswer_7": {
    "message": "У расширения есть очередь загрузок — вы можете поставить на загрузку несколько фильмов/сериалов, и как только появится свободный слот расширение автоматически поставит на загрузку следующее видео. Количество слотов загрузки можно настроить в разделе «Настройки»."
  },
  "settings_FaqQuestion_8": {
    "message": "Поддерживает ли расширение фоновую загрузку?"
  },
  "settings_FaqAnswer_8": {
    "message": "Да. Расширение поддерживает загрузку в фоне, инициатором загрузки выступает само расширение и пока работает браузер расширение будет загружать файлы."
  },
  "settings_FaqQuestion_9": {
    "message": "Как происходит загрузка файлов, используется ли torrent-протокол?"
  },
  "settings_FaqAnswer_9": {
    "message": "Нет — torrent-протокол не используется. Расширение имитирует работу плеера на сайте и использует потоковую передачу данных. Если вас интересуют правовые аспекты использования расширения: само расширение является лишь внешним интерфейсом для загрузки с сайта, и все правовые вопросы следует адресовать администрации сайта, а не расширению."
  },
  "settings_ChangelogAdded": {
    "message": "Добавлено"
  },
  "settings_ChangelogFixed": {
    "message": "Исправлено"
  },
  "settings_ChangelogChanged": {
    "message": "Изменено"
  }
}
