{
  "manifest_description": {
    "message": "Швидке та зручне завантаження фільмів та серіалів з rezka.ag! Отримайте доступ до улюблених фільмів та серіалів за кілька кліків."
  },
  "popup_stub_default": {
    "message": "Для завантаження відео перейдіть на сторінку серіалу чи фільму на сайті"
  },
  "popup_stub_trailer": {
    "message": "Схоже, що контент в очікуванні виходу.\nПоверніться сюди пізніше!"
  },
  "popup_stub_locationFilm": {
    "message": "На жаль, але фільм не доступний з вашого місця розташування :("
  },
  "popup_stub_locationSerial": {
    "message": "На жаль, але серіал не доступний з вашого місця розташування :("
  },
  "popup_stub_vpn": {
    "message": "Спробуйте скористатися VPN."
  },
  "popup_stub_unavailable": {
    "message": "Контент недоступний для завантаження — відсутні дані для обробки."
  },
  "popup_stub_error": {
    "message": "Упс! Здається щось пішло не так..."
  },
  "popup_stub_splitView": {
    "message": "Вкладка відкрита в режимі Split View, для роботи з нею потрібно вибрати бажане вікно."
  },
  "popup_loadSerial": {
    "message": "Завантажити серіал"
  },
  "popup_loadSubtitle": {
    "message": "Завантажити субтитри"
  },
  "popup_textFrom": {
    "message": "з"
  },
  "popup_textTo": {
    "message": "до"
  },
  "popup_textEndEpisodes": {
    "message": "кінця сезону"
  },
  "popup_textEndSeasons": {
    "message": "кінця серіалу"
  },
  "popup_subtitleLang": {
    "message": "Мова"
  },
  "popup_quality": {
    "message": "Якість"
  },
  "popup_translate": {
    "message": "Озвучення"
  },
  "popup_DownloadCancel": {
    "message": "Відмінити завантаження"
  },
  "combobox_placeholder": {
    "message": "Оберіть значення"
  },
  "combobox_search": {
    "message": "Пошук..."
  },
  "combobox_empty": {
    "message": "Нічого не знайдено"
  },
  "message_noDataVideo": {
    "message": "Неможливо отримати дані відео. Перевірте інтернет-з'єднання або застосуйте VPN."
  },
  "message_errorLoad": {
    "message": "Помилка завантаження. Перевірте інтернет-з'єднання або застосуйте VPN."
  },
  "message_userBreak": {
    "message": "Ви перервали завантаження."
  },
  "settings_TabSettings": {
    "message": "Налаштування"
  },
  "settings_TabFAQ": {
    "message": "FAQ"
  },
  "settings_TabChangelog": {
    "message": "Історія змін"
  },
  "settings_TabAbout": {
    "message": "Про розширення"
  },
  "settings_SourceCode": {
    "message": "Вихідний код на GitHub"
  },
  "settings_DownloadExtension": {
    "message": "Завантажити розширення"
  },
  "settings_ShortDescription": {
    "message": "Open Source розширення для завантаження фільмів та серіалів з rezka.ag!"
  },
  "settings_LongDescription": {
    "message": "HDrezka Grabber — універсальний інструмент для завантаження улюблених фільмів і серіалів з rezka.ag! Контролюйте все: обирайте озвучку, субтитри або, якщо потрібно, завантажте цілий серіал в один клік. Налаштовуйте шаблон назв файлів для своєї медіатеки та пришвидшуйте процес за допомогою паралельного завантаження. Сучасний мінімалістичний інтерфейс із підтримкою світлої та темної теми, а також доступність для більшості браузерів роблять цей інструмент вашим ідеальним помічником."
  },
  "settings_AboutTitle": {
    "message": "Про проєкт"
  },
  "settings_LicenseTitle": {
    "message": "Ліцензія"
  },
  "settings_ContactsTitle": {
    "message": "Контакти"
  },
  "settings_CopyTitle": {
    "message": "Копіювати"
  },
  "settings_SupportTitle": {
    "message": "Підтримати проєкт"
  },
  "settings_SupportDescription": {
    "message": "Дякуємо, що користуєтеся $extensionName$. Якщо вам подобається розширення, будь ласка, подумайте про невелике пожертвування як знак вдячності.",
    "placeholders": {
      "extensionName": {
        "content": "$1"
      }
    }
  },
  "settings_SupportButton": {
    "message": "Підтримати"
  },
  "settings_patreonSubtitle": {
    "message": "Щомісячна підтримка"
  },
  "settings_PayPalSubtitle": {
    "message": "Разове пожертвування"
  },
  "settings_MoneroSubtitle": {
    "message": "Криптовалютна підтримка"
  },
  "settings_GitHubSubtitle": {
    "message": "Спонсорство через GitHub"
  },
  "settings_DevelopersTitle": {
    "message": "Люди, причетні до розробки"
  },
  "settings_AuthorDescription": {
    "message": "Автор проєкту. Відповідає за розробку внутрішньої логіки роботи розширення."
  },
  "settings_SecondPilotDescription": {
    "message": "Другий пілот. Відповідає за дизайн та зовнішній вигляд розширення."
  },
  "settings_FaqQuestion_1": {
    "message": "Як обрати, куди завантажувати файли?"
  },
  "settings_FaqAnswer_1": {
    "message": "Розширення ніяк не може на це вплинути. Браузер не дозволяє розширенням вказувати шляхи поза стандартною папкою \"Завантаження\". Єдиний варіант — вручну змінити стандартну папку завантаження в налаштуваннях браузера."
  },
  "settings_FaqQuestion_2": {
    "message": "Під час вибору якості 1080р/1080р-Ultra завантажується відеофайл із роздільною здатністю 720р"
  },
  "settings_FaqAnswer_2": {
    "message": "Це не баг розширення, а особливість роботи сайту. Щоб показати фільм, плеєр запитує у сервера посилання на відео потрібної якості. Якщо сервер перевантажений, він може автоматично знизити якість — наприклад, замість 1080p видати 720p. Розширення отримує рівно те посилання, яке повертає сервер. Перевірити ситуацію можна прямо на сайті: у плеєрі якість також знизиться."
  },
  "settings_FaqQuestion_3": {
    "message": "Розширення повільно завантажує файли, хоча в мене швидкий інтернет"
  },
  "settings_FaqAnswer_3": {
    "message": "Розширення не сповільнює завантаження. Швидкість залежить не лише від вашого інтернету, але й від серверів, з яких іде роздача. У години пік вони можуть працювати повільніше, через що падає швидкість і інколи навіть якість відео."
  },
  "settings_FaqQuestion_4": {
    "message": "Як працює розширення?"
  },
  "settings_FaqAnswer_4": {
    "message": "Коли ви відкриваєте випадне меню, розширення перевіряє, чи на відповідному ви сайті. Якщо це не фільм або серіал на сайті з сімейства rezka.ag, воно просто покаже заглушку та зупиниться. Якщо сторінка підходить, розширення отримує дані плеєра (серія, озвучення, параметри тощо). Для цього на сторінку тимчасово вставляється скрипт, який збирає потрібну інформацію та передає її розширенню. Коли ви натискаєте «Завантажити», розширення формує ім'я файлу та запитує у сервера список посилань на відео різної якості. Розширення обирає потрібне посилання та передає його браузеру, який і запускає завантаження. Далі розширення просто стежить за завантаженням та реагує на його події. Також воно може керувати одразу кількома завантаженнями."
  },
  "settings_FaqQuestion_5": {
    "message": "Навіщо розширенню потрібен доступ до всіх сайтів?"
  },
  "settings_FaqAnswer_5": {
    "message": "Доступ до всіх сайтів потрібен для того, щоб розширення могло працювати з дзеркалами rezka."
  },
  "settings_FaqQuestion_6": {
    "message": "Чи підтримує розширення інші дзеркала сайту?"
  },
  "settings_FaqAnswer_6": {
    "message": "Так, підтримує. Під час відкриття попапу розширення перевіряє, чи відповідає сайт шаблону побудови сайту rezka.ag; якщо ні, воно повідомить вас, що сайт не розпізнано, і запропонує перейти на офіційний сайт rezka.ag. Оскільки всі ОФІЦІЙНІ дзеркала відповідають шаблону, вони працюватимуть без проблем, але зверніть увагу: окрім офіційних дзеркал можуть бути й інші! У рідкісних випадках шаблон у розширенні може застаріти — тоді завантаження буде неможливим навіть з офіційного сайту."
  },
  "settings_FaqQuestion_7": {
    "message": "Як завантажувати кілька фільмів/серіалів одночасно?"
  },
  "settings_FaqAnswer_7": {
    "message": "У розширення є черга завантажень — ви можете поставити на завантаження кілька фільмів/серіалів, і щойно з'явиться вільний слот, розширення автоматично поставить на завантаження наступне відео. Кількість слотів можна налаштувати в розділі «Налаштування»."
  },
  "settings_FaqQuestion_8": {
    "message": "Чи підтримує розширення фонове завантаження?"
  },
  "settings_FaqAnswer_8": {
    "message": "Так. Розширення підтримує завантаження у фоні, ініціатором завантаження виступає саме розширення, і доки працює браузер — розширення завантажуватиме файли."
  },
  "settings_FaqQuestion_9": {
    "message": "Як відбувається завантаження файлів, чи використовується torrent-протокол?"
  },
  "settings_FaqAnswer_9": {
    "message": "Ні — torrent-протокол не використовується. Розширення імітує роботу плеєра на сайті та використовує потокову передачу даних. Якщо вас цікавлять правові аспекти використання розширення: саме розширення є лише зовнішнім інтерфейсом для завантаження з сайту, і всі правові питання слід адресувати адміністрації сайту, а не розширенню."
  },
  "settings_ChangelogAdded": {
    "message": "Додано"
  },
  "settings_ChangelogFixed": {
    "message": "Виправлено"
  },
  "settings_ChangelogChanged": {
    "message": "Змінено"
  }
}
