{
  "manifest_description": {
    "message": "Швидке та зручне завантаження фільмів та серіалів з rezka.ag! Отримайте доступ до улюблених фільмів та серіалів за кілька кліків."
  },
  "popup_stub_default": {
    "message": "Для завантаження відео перейдіть на сторінку серіалу чи фільму на сайті"
  },
  "popup_stub_trailer": {
    "message": "Схоже, що контент в очікуванні виходу.\nПоверніться сюди пізніше!"
  },
  "popup_stub_locationFilm": {
    "message": "На жаль, але фільм не доступний з вашого місця розташування :("
  },
  "popup_stub_locationSerial": {
    "message": "На жаль, але серіал не доступний з вашого місця розташування :("
  },
  "popup_stub_vpn": {
    "message": "Спробуйте скористатися VPN."
  },
  "popup_stub_unavailable": {
    "message": "Контент недоступний для завантаження — відсутні дані для обробки."
  },
  "popup_stub_error": {
    "message": "Упс! Здається щось пішло не так..."
  },
  "popup_loadSerial": {
    "message": "Завантажити серіал"
  },
  "popup_loadSubtitle": {
    "message": "Завантажити субтитри"
  },
  "popup_textFrom": {
    "message": "з"
  },
  "popup_textTo": {
    "message": "до"
  },
  "popup_textEndEpisodes": {
    "message": "кінця сезону"
  },
  "popup_textEndSeasons": {
    "message": "кінця серіалу"
  },
  "popup_subtitleLang": {
    "message": "Мова"
  },
  "popup_quality": {
    "message": "Якість"
  },
  "popup_translate": {
    "message": "Озвучення"
  },
  "combobox_placeholder": {
    "message": "Оберіть значення"
  },
  "combobox_search": {
    "message": "Пошук..."
  },
  "combobox_empty": {
    "message": "Нічого не знайдено"
  },
  "message_noDataVideo": {
    "message": "Неможливо отримати дані відео. Перевірте інтернет-з'єднання або застосуйте VPN."
  },
  "message_errorLoad": {
    "message": "Помилка завантаження. Перевірте інтернет-з'єднання або застосуйте VPN."
  },
  "message_userBreak": {
    "message": "Ви перервали завантаження."
  },
  "settings_TabSettings": {
    "message": "Налаштування"
  },
  "settings_TabFAQ": {
    "message": "FAQ"
  },
  "settings_TabChangelog": {
    "message": "Історія змін"
  },
  "settings_TabAbout": {
    "message": "Про розширення"
  },
  "settings_SourceCode": {
    "message": "Вихідний код на GitHub"
  },
  "settings_DownloadExtension": {
    "message": "Завантажити розширення"
  },
  "settings_ShortDescription": {
    "message": "Open Source розширення для завантаження фільмів та серіалів з rezka.ag!"
  },
  "settings_LongDescription": {
    "message": "HDrezka Grabber — універсальний інструмент для завантаження улюблених фільмів і серіалів з rezka.ag! Контролюйте все: обирайте озвучку, субтитри або, якщо потрібно, завантажте цілий серіал в один клік. Налаштовуйте шаблон назв файлів для своєї медіатеки та пришвидшуйте процес за допомогою паралельного завантаження. Сучасний мінімалістичний інтерфейс із підтримкою світлої та темної теми, а також доступність для більшості браузерів роблять цей інструмент вашим ідеальним помічником."
  },
  "settings_AboutTitle": {
    "message": "Про проєкт"
  },
  "settings_LicenseTitle": {
    "message": "Ліцензія"
  },
  "settings_ContactsTitle": {
    "message": "Контакти"
  },
  "settings_CopyTitle": {
    "message": "Копіювати"
  },
  "settings_SupportTitle": {
    "message": "Підтримати проєкт"
  },
  "settings_SupportDescription": {
    "message": "Дякуємо, що користуєтеся $extensionName$. Якщо вам подобається розширення, будь ласка, подумайте про невелике пожертвування як знак вдячності.",
    "placeholders": {
      "extensionName": {
        "content": "$1"
      }
    }
  },
  "settings_SupportButton": {
    "message": "Підтримати"
  },
  "settings_patreonSubtitle": {
    "message": "Щомісячна підтримка"
  },
  "settings_PayPalSubtitle": {
    "message": "Разове пожертвування"
  },
  "settings_MoneroSubtitle": {
    "message": "Криптовалютна підтримка"
  },
  "settings_GitHubSubtitle": {
    "message": "Спонсорство через GitHub"
  },
  "settings_DevelopersTitle": {
    "message": "Люди, причетні до розробки"
  },
  "settings_AuthorDescription": {
    "message": "Автор проєкту. Відповідає за розробку внутрішньої логіки роботи розширення."
  },
  "settings_SecondPilotDescription": {
    "message": "Другий пілот. Відповідає за дизайн та зовнішній вигляд розширення."
  },
  "settings_FaqQuestion_1": {
    "message": "Як обрати, куди завантажувати файли?"
  },
  "settings_FaqAnswer_1": {
    "message": "На жаль, розширення ніяк не може вплинути на це. Єдиний реальний варіант — вручну змінити папку завантажень, що вкрай непрактично. Це пов’язано з тим, що розширення використовує browser downloads API, який не дозволяє вказувати шляхи поза стандартною папкою «Завантаження» — зроблено це з міркувань безпеки, адже погодьтеся, вам би не сподобалося, якби хто-завгодно міг завантажити файл незрозумілого змісту в будь-яке місце вашого комп’ютера."
  },
  "settings_FaqQuestion_2": {
    "message": "При виборі якості 1080p/1080p-Ultra завантажується відеофайл у якості 720p"
  },
  "settings_FaqAnswer_2": {
    "message": "Це не баг розширення, а радше наслідок принципу його роботи. Щоб переглянути фільм на сайті, плеєр спершу повинен «попросити» сервер надати доступ до потрібного відео, сервер поверне у відповідь посилання — кожна якість (360p чи 1080p) — це унікальне посилання, яке може надати лише сервер, адже саме на ньому зберігаються всі фільми й серіали. Розширення імітує роботу плеєра та знає, як отримати це посилання, щоб завантажити файл. Але коли сервери rezka перевантажені, вони починають знижувати якість. Ви все ще бачитимете вибір 1080p, але при запиті сервер автоматично знизить якість на щабель нижче — у даному випадку до 720p. Розширення вміє визначати таке зниження, але, оскільки отримати посилання на 1080p воно не може, завантажує доступне. У налаштуваннях можна задати поведінку при зниженні якості. Також, оскільки розширення імітує роботу плеєра, ви можете самі пересвідчитися у зниженні якості — достатньо переглянути відео на сайті."
  },
  "settings_FaqQuestion_3": {
    "message": "Розширення повільно завантажує файли, хоча інтернет швидкий"
  },
  "settings_FaqAnswer_3": {
    "message": "Розширення не впливає на швидкість завантаження, адже використовує вбудований browser download API, через що реальним ініціатором завантаження є сам браузер. Швидкість залежить не лише від вашого інтернету: вона може обмежуватися швидкістю віддачі серверів rezka. Особливо це помітно ввечері, коли люди повертаються додому й починають дивитися фільми — сервери перевантажуються, що може впливати на швидкість завантаження файлу, аж до зниження якості відео (коли замість 1080p сервер віддає 720p). Але залишаються загадковими моменти, коли при одночасному завантаженні кількох файлів один інколи зупиняється на половині, тоді як інші завантажуються повністю. Іноді допомагає зупинити повільне завантаження та одразу запустити його знову."
  },
  "settings_FaqQuestion_4": {
    "message": "Як працює розширення?"
  },
  "settings_FaqAnswer_4": {
    "message": "Спростивши, логіку роботи розширення можна описати так. Коли ви відкриваєте попап, відбувається кілька основних подій. Розширення намагається визначити тип сторінки — якщо це не сторінка з фільмом чи серіалом на сайтах сімейства rezka.ag, воно покаже повідомлення про непридатність і припинить подальші дії. Якщо тип підходить, розширення отримує дані плеєра (службова інформація, номери серій, типи озвучок, обрані параметри тощо). Для цього вставляється скрипт, що витягує дані зі сторінки та надсилає їх у розширення. Після запуску завантаження починається етап ініціалізації: потрібні два параметри — ім’я файлу та посилання. Ім’я формується з даних попапа й шаблону користувача; посилання ж повертає сервер. Імітуючи плеєр, розширення надсилає серверу запит із потрібними даними, а у відповідь отримує список посилань і відповідні їм якості (саме тут можлива проблема, коли сервер віддає посилання з нижчою якістю). Розширення обирає потрібне посилання та передає його браузеру для завантаження. Це може зайняти трохи часу. Браузер завантажує файл, а розширення відстежує події завантаження й реагує відповідно. При цьому воно керує кількома завантаженнями одночасно — адже в черзі може бути 100+ файлів."
  },
  "settings_FaqQuestion_5": {
    "message": "Навіщо розширенню потрібен доступ до всіх сайтів?"
  },
  "settings_FaqAnswer_5": {
    "message": "Доступ до усіх сайтів потрібен у випадку використання дзеркал rezka. Під час розробки було два варіанти: або оновлювати список доступних сайтів при появі нового дзеркала, або дати розширенню доступ до всіх сайтів і при кожній взаємодії перевіряти, чи є сайт цільовим. Я обрав другий варіант — він менш затратний за часом. До того ж, якщо підтримка припиниться, розширення все одно працюватиме з наявними дзеркалами."
  },
  "settings_FaqQuestion_6": {
    "message": "Чи підтримує розширення інші дзеркала сайту?"
  },
  "settings_FaqAnswer_6": {
    "message": "Так, підтримує. При відкритті попапа розширення перевіряє, чи відповідає сайт шаблону побудови rezka.ag; якщо ні — воно повідомить, що сайт не розпізнано, і запропонує перейти на офіційний rezka.ag. Усі ОФІЦІЙНІ дзеркала відповідають шаблону, тому проблем не виникне. Але зверніть увагу: можуть існувати й інші дзеркала! У рідкісних випадках шаблон може застаріти — тоді завантаження буде неможливим навіть з офіційного сайту."
  },
  "settings_FaqQuestion_7": {
    "message": "Як завантажувати кілька фільмів/серіалів одночасно?"
  },
  "settings_FaqAnswer_7": {
    "message": "Розширення підтримує фонове завантаження, тобто вам НЕ обов’язково залишатися на сторінці, з якої ви запустили завантаження: після запуску можна закрити вкладку та займатися іншими справами. Є черга завантажень — ви можете додати кілька фільмів/серіалів, і щойно звільниться слот, розширення автоматично запустить наступне відео. Кількість слотів можна налаштувати в розділі «Налаштування»."
  },
  "settings_FaqQuestion_8": {
    "message": "Як відбувається завантаження файлів, чи використовується torrent-протокол?"
  },
  "settings_FaqAnswer_8": {
    "message": "Ні — torrent-протокол не використовується. Розширення імітує роботу плеєра на сайті та використовує потокову передачу файлів. Якщо вас цікавлять правові аспекти: саме розширення є лише зовнішнім інтерфейсом для завантаження з сайту, і всі правові питання слід адресувати адміністрації сайту, а не розширенню."
  }
}
